Revit 2027 API
PrimarySizeCriterion.None Method
 Creates a criterion with a range of no sizes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PrimarySizeCriterion None()
Public Shared Function None As PrimarySizeCriterion
public:
static PrimarySizeCriterion^ None()
static member None : unit -> PrimarySizeCriterion
Return Value
PrimarySizeCriterion
 The new criterion.
See Also
Reference
PrimarySizeCriterion Class
Autodesk.Revit.DB Namespace